# ==============================================================================
# Ref: "Alpha 101"
# # Alpha#19:
# -1 * 
# rank[open - delay(high,1)] *
# rank[open - delay(close,1)] *
# rank[open - delay(low,1)]             
# #
# 算法
# 1.
#
# 含义
# 本质上说，判断开盘价的异常，如果与上一天的 high,close,low，都是显著的差异，则发出做款指令
#        也就是所，对于开盘价格，判断其会回归 

# 关联：
# 
# ==============================================================================

# ------------------------------------------------------------------------------
## Alpha Name
alphaName <- 'alpha101_20'

## 需要去除的日期
truncatedTD <- 1
# ------------------------------------------------------------------------------

# ==========: 提取dtX ===============================================================================
# ------------------------------------------------------------------------------
# dtX
# ------------------------------------------------------------------------------ 

# ------------------------------------------------------------------------------
# 计算 signal

# ------------------------------------------------------------------------------
dtX <- inSample[, .SD[.N > truncatedTD]
                , by = 'InstrumentID'] %>%
        .[,":="(
            signal1 = open - shift(high,1L,type='lag'),
            signal2 = open - shift(close,1L,type='lag'),
            signal3 = open - shift(low,1L,type='lag')
          )
          , by = 'InstrumentID'] %>%
        .[!is.na(signal1) & !is.na(signal2) & !is.na(signal3)] %>%
        .[, ":="(
            rank1 = base::rank(signal1, ties.method = 'max'),
            rank2 = base::rank(signal2, ties.method = 'max'),
            rank3 = base::rank(signal3, ties.method = 'max')
          )
          , by = 'TradingDay'] %>%
        .[, mySignal := rank1 * rank2 * rank3 %>% as.numeric()] %>% 
        .[, mySignal := (mySignal - mean(mySignal)) / sd(mySignal) * sqrt(nrow(.SD)),
          , by = 'TradingDay']
# ==================================================================================================
