# ==============================================================================
# Ref: "Alpha 101"
# Alpha#6:
# -1 * [ correlation(open, volume, 10) ]
#        |----------- 1 ------------|
# |------------------ 2 ---------------|
#
# 算法
# 1.先去 open 与 volume 前面 10 天的数据，计算相关系数
# 2.取相关系数小的为佳
#
# 含义
# 本质上说，是看 open 与 volume 出现相背离时，预测收益回归
# ==============================================================================

# ------------------------------------------------------------------------------
## Alpha Name
alphaName <- 'alpha101_06'

## 需要去除的日期
truncatedTD <- 10
# ------------------------------------------------------------------------------


# ==========: 提取dtX ===============================================================================
# ------------------------------------------------------------------------------
# dtX
# ------------------------------------------------------------------------------ 

# ------------------------------------------------------------------------------
# 计算 correlation
Cal_Signal <- function(x){
    tempRes <- cbind(x, mySignal = NaN)

    tempDT <- sapply((truncatedTD + 1):nrow(tempRes), function(i){
        # print(i)
        tempTradingDay <- tempRes[i,TradingDay]
        temp <- tempRes[TradingDay < tempTradingDay][(.N - truncatedTD) : .N]
        temp <- temp[, cor(open,volume)]
        return(temp)
    })

    tempRes[(truncatedTD + 1):nrow(tempRes), mySignal := tempDT]
    return(tempRes)
}

if(FALSE){
    x <- dtX[InstrumentID == 'al1104']
    temp <- Cal_Signal(x)
}
# ------------------------------------------------------------------------------
dtX <- inSample[, .SD[.N > truncatedTD]
                , by = 'InstrumentID'] %>%
                .[, Cal_Signal(.SD)
                  , by = 'InstrumentID'] %>%
                .[!is.na(mySignal)]
# ==================================================================================================
