rm(list = ls())

################################################################################
## Step0: 初始参数设置
################################################################################
## temp <- dirname(parent.frame(1)$ofile)
## setwd(temp)
setwd("/home/william/myCodes/oiRank/")

suppressMessages(
  suppressWarnings({
    source('./conf/myInit.R');source('./conf/myConfig.R')
  })
)

################################################################################
## Step1: 获取数据
################################################################################
source('./R/oiRank_01_fetch_data.R')

